## Dealing With Rows and Column in Pandaas Dataframe

- Dataframe is a two-dimensional data structure, i.e., data is aligned in tabular fashion in rows and column.

- We can perfom basic operation on rows/columns like selectiin, deleting, adding and renaming

## Creating a DataFrame

In [33]:
# Import pandas package 
import pandas as pd 

# Define a dictionary containing employee data 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
		'Age':[27, 24, 22, 32], 
		'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

###  Column Selection

In [34]:
# Selecting a single column
df['Name']

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

In [35]:
# select two columns 
df[['Name', 'Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [36]:
# select all rows  
# and second to fourth column 
df[df.columns[1:4]]

   Age    Address Qualification
0   27      Delhi           Msc
1   24     Kanpur            MA
2   22  Allahabad           MCA
3   32    Kannauj           Phd

## Column Selection using loc[]

    **loc[rows, columns]

In [37]:
#select three rows and tow column

df.loc[1:3, ['Name', 'Qualification']]

     Name Qualification
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [38]:
# select two rows and  
# column "name" to "Address" 
# Means total three columns 
df.loc[0:1, 'Name':'Address']

     Name  Age Address
0     Jai   27   Delhi
1  Princi   24  Kanpur

In [39]:
# row 1, all columns 
df.loc[0, :]

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

## Column Selection using iloc[]

    **iloc[row_slice, columns_slice]

In [40]:
# Select all rows
#select the first two columns
df.iloc[:, 0:2]

     Name  Age
0     Jai   27
1  Princi   24
2  Gaurav   22
3    Anuj   32

## Adding a New column in existing column

### Method1: By declaring a new list as a colum

In [41]:
# Declaring a list as a column name.

address = ['Mathare', 'Umoja', 'Upperhill', 'Lavingtone']

# Using 'Address' as the column name
# and equating it to the list

df['Address'] = address

print(df)

     Name  Age     Address Qualification
0     Jai   27     Mathare           Msc
1  Princi   24       Umoja            MA
2  Gaurav   22   Upperhill           MCA
3    Anuj   32  Lavingtone           Phd

### Method2: Using method DataFrame.insert()

- Insert()function give the freedom to add a column at any position

- It also provide different options for inserting the column values

In [43]:
df.insert(1, 'Height', [5.1, 6.2, 5.1, 5.2])
# Inserts 'Height' column in index 1
print(df)

     Name  Height  Age     Address Qualification
0     Jai     5.1   27     Mathare           Msc
1  Princi     6.2   24       Umoja            MA
2  Gaurav     5.1   22   Upperhill           MCA
3    Anuj     5.2   32  Lavingtone           Phd

### Method3: Using DataFrame.assign()

- This method will create a new dataframe with a new column added tothe old  dataframe

In [47]:
# Using 'Address' as the column name and equating it to the list

new_df= df.assign(Tribe=['Kisii', 'Kikuyu', 'Kamba', 'Luo'])

print(new_df)

     Name  Height  Age     Address Qualification   Tribe
0     Jai     5.1   27     Mathare           Msc   Kisii
1  Princi     6.2   24       Umoja            MA  Kikuyu
2  Gaurav     5.1   22   Upperhill           MCA   Kamba
3    Anuj     5.2   32  Lavingtone           Phd     Luo